import "./Card04.css";

function Card04() {
  return (
    <div class="card04-width">
      <div class="swiper-slide-04">
        <div class="post-item-content-04">
          <div class="post-content-top-04">
            <div class="post-cover-04">
              <a href="#">
                <img
                  src="./assets/course04-01.png"
                  class="attachment-full-04"
                  alt=""
                />
              </a>
            </div>
            <div class="post-details-04">
              <div class="post-content-header-04">
                <div class="post-cats-04">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="25"
                    viewBox="0 0 24 25"
                    fill="none"
                  >
                    <path
                      d="M14 14.799C13.63 14.799 13.3 14.519 13.26 14.139C13.21 13.729 13.5 13.349 13.91 13.299C16.55 12.969 19.08 11.969 21.21 10.419C21.54 10.169 22.01 10.249 22.26 10.589C22.5 10.919 22.43 11.389 22.09 11.639C19.75 13.339 16.99 14.429 14.09 14.799C14.06 14.799 14.03 14.799 14 14.799Z"
                      fill="#FFD342"
                    ></path>
                    <path
                      d="M9.99975 14.8091C9.96975 14.8091 9.93975 14.8091 9.90975 14.8091C7.16975 14.4991 4.49975 13.4991 2.18975 11.9191C1.84975 11.6891 1.75975 11.2191 1.98975 10.8791C2.21975 10.5391 2.68975 10.4491 3.02975 10.6791C5.13975 12.1191 7.56975 13.0291 10.0697 13.3191C10.4797 13.3691 10.7797 13.7391 10.7297 14.1491C10.6997 14.5291 10.3797 14.8091 9.99975 14.8091Z"
                      fill="#FFD342"
                    ></path>
                    <path
                      d="M16.0002 22.7791H8.00023C3.38023 22.7791 2.52023 20.6291 2.30023 18.5391L1.55023 10.5291C1.44023 9.47906 1.41023 7.92906 2.45023 6.76906C3.35023 5.76906 4.84023 5.28906 7.00023 5.28906H17.0002C19.1702 5.28906 20.6602 5.77906 21.5502 6.76906C22.5902 7.92906 22.5602 9.47906 22.4502 10.5391L21.7002 18.5291C21.4802 20.6291 20.6202 22.7791 16.0002 22.7791ZM7.00023 6.77906C5.31023 6.77906 4.15023 7.10906 3.56023 7.76906C3.07023 8.30906 2.91023 9.13906 3.04023 10.3791L3.79023 18.3891C3.96023 19.9691 4.39023 21.2791 8.00023 21.2791H16.0002C19.6002 21.2791 20.0402 19.9691 20.2102 18.3791L20.9602 10.3891C21.0902 9.13906 20.9302 8.30906 20.4402 7.76906C19.8502 7.10906 18.6902 6.77906 17.0002 6.77906H7.00023Z"
                      fill="white"
                    ></path>
                    <path
                      d="M16 6.77905C15.59 6.77905 15.25 6.43905 15.25 6.02905V5.22905C15.25 3.44905 15.25 2.77905 12.8 2.77905H11.2C8.75 2.77905 8.75 3.44905 8.75 5.22905V6.02905C8.75 6.43905 8.41 6.77905 8 6.77905C7.59 6.77905 7.25 6.43905 7.25 6.02905V5.22905C7.25 3.46905 7.25 1.27905 11.2 1.27905H12.8C16.75 1.27905 16.75 3.46905 16.75 5.22905V6.02905C16.75 6.43905 16.41 6.77905 16 6.77905Z"
                      fill="white"
                    ></path>
                    <path
                      d="M12 16.7791C9.25 16.7791 9.25 15.0791 9.25 14.0591V13.0291C9.25 11.6191 9.59 11.2791 11 11.2791H13C14.41 11.2791 14.75 11.6191 14.75 13.0291V14.0291C14.75 15.0691 14.75 16.7791 12 16.7791ZM10.75 12.7791C10.75 12.8591 10.75 12.9491 10.75 13.0291V14.0591C10.75 15.0891 10.75 15.2791 12 15.2791C13.25 15.2791 13.25 15.1191 13.25 14.0491V13.0291C13.25 12.9491 13.25 12.8591 13.25 12.7791C13.17 12.7791 13.08 12.7791 13 12.7791H11C10.92 12.7791 10.83 12.7791 10.75 12.7791Z"
                      fill="#FFD342"
                    ></path>
                  </svg>
                  <a href="#" class="item-cat-04">
                    کسب و کار
                  </a>
                </div>
                <div class="post-title-wrap-04">
                  <a href="#">
                    <h2 class="post-title-04">
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
                    </h2>
                  </a>
                </div>
              </div>
              <div class="post-excerpt-04">
                <p>
                  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
                  با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و
                  مجله در ستون و سطرآنچنان که...
                </p>
              </div>
            </div>
          </div>
          <div class="post-content-bottom-04">
            <a class="item-main-btn-04" href="">
              <span>مشاهده بیشتر</span>
            </a>
            <a href="#" class="item-sec-btn-04">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="25"
                viewBox="0 0 24 25"
                fill="none"
              >
                <path
                  d="M8 2.02905V5.02905"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M16 2.02905V5.02905"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  opacity="0.4"
                  d="M7 13.0291H15"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  opacity="0.4"
                  d="M7 17.0291H12"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M16 3.52905C19.33 3.70905 21 4.97905 21 9.67905V15.8591C21 19.9791 20 22.0391 15 22.0391H9C4 22.0391 3 19.9791 3 15.8591V9.67905C3 4.97905 4.67 3.71905 8 3.52905H16Z"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <span>شرکت در رویداد</span>
            </a>
          </div>
        </div>
      </div>
      <div class="swiper-slide-04">
        <div class="post-item-content-04">
          <div class="post-content-top-04">
            <div class="post-cover-04">
              <a href="#">
                <img
                  src="./assets/course04-02.png"
                  class="attachment-full-04"
                  alt=""
                />
              </a>
            </div>
            <div class="post-details-04">
              <div class="post-content-header-04">
                <div class="post-cats-04">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="25"
                    viewBox="0 0 24 25"
                    fill="none"
                  >
                    <path
                      d="M14 14.799C13.63 14.799 13.3 14.519 13.26 14.139C13.21 13.729 13.5 13.349 13.91 13.299C16.55 12.969 19.08 11.969 21.21 10.419C21.54 10.169 22.01 10.249 22.26 10.589C22.5 10.919 22.43 11.389 22.09 11.639C19.75 13.339 16.99 14.429 14.09 14.799C14.06 14.799 14.03 14.799 14 14.799Z"
                      fill="#FFD342"
                    ></path>
                    <path
                      d="M9.99975 14.8091C9.96975 14.8091 9.93975 14.8091 9.90975 14.8091C7.16975 14.4991 4.49975 13.4991 2.18975 11.9191C1.84975 11.6891 1.75975 11.2191 1.98975 10.8791C2.21975 10.5391 2.68975 10.4491 3.02975 10.6791C5.13975 12.1191 7.56975 13.0291 10.0697 13.3191C10.4797 13.3691 10.7797 13.7391 10.7297 14.1491C10.6997 14.5291 10.3797 14.8091 9.99975 14.8091Z"
                      fill="#FFD342"
                    ></path>
                    <path
                      d="M16.0002 22.7791H8.00023C3.38023 22.7791 2.52023 20.6291 2.30023 18.5391L1.55023 10.5291C1.44023 9.47906 1.41023 7.92906 2.45023 6.76906C3.35023 5.76906 4.84023 5.28906 7.00023 5.28906H17.0002C19.1702 5.28906 20.6602 5.77906 21.5502 6.76906C22.5902 7.92906 22.5602 9.47906 22.4502 10.5391L21.7002 18.5291C21.4802 20.6291 20.6202 22.7791 16.0002 22.7791ZM7.00023 6.77906C5.31023 6.77906 4.15023 7.10906 3.56023 7.76906C3.07023 8.30906 2.91023 9.13906 3.04023 10.3791L3.79023 18.3891C3.96023 19.9691 4.39023 21.2791 8.00023 21.2791H16.0002C19.6002 21.2791 20.0402 19.9691 20.2102 18.3791L20.9602 10.3891C21.0902 9.13906 20.9302 8.30906 20.4402 7.76906C19.8502 7.10906 18.6902 6.77906 17.0002 6.77906H7.00023Z"
                      fill="white"
                    ></path>
                    <path
                      d="M16 6.77905C15.59 6.77905 15.25 6.43905 15.25 6.02905V5.22905C15.25 3.44905 15.25 2.77905 12.8 2.77905H11.2C8.75 2.77905 8.75 3.44905 8.75 5.22905V6.02905C8.75 6.43905 8.41 6.77905 8 6.77905C7.59 6.77905 7.25 6.43905 7.25 6.02905V5.22905C7.25 3.46905 7.25 1.27905 11.2 1.27905H12.8C16.75 1.27905 16.75 3.46905 16.75 5.22905V6.02905C16.75 6.43905 16.41 6.77905 16 6.77905Z"
                      fill="white"
                    ></path>
                    <path
                      d="M12 16.7791C9.25 16.7791 9.25 15.0791 9.25 14.0591V13.0291C9.25 11.6191 9.59 11.2791 11 11.2791H13C14.41 11.2791 14.75 11.6191 14.75 13.0291V14.0291C14.75 15.0691 14.75 16.7791 12 16.7791ZM10.75 12.7791C10.75 12.8591 10.75 12.9491 10.75 13.0291V14.0591C10.75 15.0891 10.75 15.2791 12 15.2791C13.25 15.2791 13.25 15.1191 13.25 14.0491V13.0291C13.25 12.9491 13.25 12.8591 13.25 12.7791C13.17 12.7791 13.08 12.7791 13 12.7791H11C10.92 12.7791 10.83 12.7791 10.75 12.7791Z"
                      fill="#FFD342"
                    ></path>
                  </svg>
                  <a href="#" class="item-cat-04">
                    کسب و کار
                  </a>
                </div>
                <div class="post-title-wrap-04">
                  <a href="#">
                    <h2 class="post-title-04">
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
                    </h2>
                  </a>
                </div>
              </div>
              <div class="post-excerpt-04">
                <p>
                  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
                  با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و
                  مجله در ستون و سطرآنچنان که...
                </p>
              </div>
            </div>
          </div>
          <div class="post-content-bottom-04">
            <a class="item-main-btn-04" href="">
              <span>مشاهده بیشتر</span>
            </a>
            <a href="#" class="item-sec-btn-04">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="25"
                viewBox="0 0 24 25"
                fill="none"
              >
                <path
                  d="M8 2.02905V5.02905"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M16 2.02905V5.02905"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  opacity="0.4"
                  d="M7 13.0291H15"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  opacity="0.4"
                  d="M7 17.0291H12"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M16 3.52905C19.33 3.70905 21 4.97905 21 9.67905V15.8591C21 19.9791 20 22.0391 15 22.0391H9C4 22.0391 3 19.9791 3 15.8591V9.67905C3 4.97905 4.67 3.71905 8 3.52905H16Z"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <span>شرکت در رویداد</span>
            </a>
          </div>
        </div>
      </div>
      <div class="swiper-slide-04">
        <div class="post-item-content-04">
          <div class="post-content-top-04">
            <div class="post-cover-04">
              <a href="#">
                <img
                  src="./assets/course04-03.png"
                  class="attachment-full-04"
                  alt=""
                />
              </a>
            </div>
            <div class="post-details-04">
              <div class="post-content-header-04">
                <div class="post-cats-04">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="25"
                    viewBox="0 0 24 25"
                    fill="none"
                  >
                    <path
                      d="M14 14.799C13.63 14.799 13.3 14.519 13.26 14.139C13.21 13.729 13.5 13.349 13.91 13.299C16.55 12.969 19.08 11.969 21.21 10.419C21.54 10.169 22.01 10.249 22.26 10.589C22.5 10.919 22.43 11.389 22.09 11.639C19.75 13.339 16.99 14.429 14.09 14.799C14.06 14.799 14.03 14.799 14 14.799Z"
                      fill="#FFD342"
                    ></path>
                    <path
                      d="M9.99975 14.8091C9.96975 14.8091 9.93975 14.8091 9.90975 14.8091C7.16975 14.4991 4.49975 13.4991 2.18975 11.9191C1.84975 11.6891 1.75975 11.2191 1.98975 10.8791C2.21975 10.5391 2.68975 10.4491 3.02975 10.6791C5.13975 12.1191 7.56975 13.0291 10.0697 13.3191C10.4797 13.3691 10.7797 13.7391 10.7297 14.1491C10.6997 14.5291 10.3797 14.8091 9.99975 14.8091Z"
                      fill="#FFD342"
                    ></path>
                    <path
                      d="M16.0002 22.7791H8.00023C3.38023 22.7791 2.52023 20.6291 2.30023 18.5391L1.55023 10.5291C1.44023 9.47906 1.41023 7.92906 2.45023 6.76906C3.35023 5.76906 4.84023 5.28906 7.00023 5.28906H17.0002C19.1702 5.28906 20.6602 5.77906 21.5502 6.76906C22.5902 7.92906 22.5602 9.47906 22.4502 10.5391L21.7002 18.5291C21.4802 20.6291 20.6202 22.7791 16.0002 22.7791ZM7.00023 6.77906C5.31023 6.77906 4.15023 7.10906 3.56023 7.76906C3.07023 8.30906 2.91023 9.13906 3.04023 10.3791L3.79023 18.3891C3.96023 19.9691 4.39023 21.2791 8.00023 21.2791H16.0002C19.6002 21.2791 20.0402 19.9691 20.2102 18.3791L20.9602 10.3891C21.0902 9.13906 20.9302 8.30906 20.4402 7.76906C19.8502 7.10906 18.6902 6.77906 17.0002 6.77906H7.00023Z"
                      fill="white"
                    ></path>
                    <path
                      d="M16 6.77905C15.59 6.77905 15.25 6.43905 15.25 6.02905V5.22905C15.25 3.44905 15.25 2.77905 12.8 2.77905H11.2C8.75 2.77905 8.75 3.44905 8.75 5.22905V6.02905C8.75 6.43905 8.41 6.77905 8 6.77905C7.59 6.77905 7.25 6.43905 7.25 6.02905V5.22905C7.25 3.46905 7.25 1.27905 11.2 1.27905H12.8C16.75 1.27905 16.75 3.46905 16.75 5.22905V6.02905C16.75 6.43905 16.41 6.77905 16 6.77905Z"
                      fill="white"
                    ></path>
                    <path
                      d="M12 16.7791C9.25 16.7791 9.25 15.0791 9.25 14.0591V13.0291C9.25 11.6191 9.59 11.2791 11 11.2791H13C14.41 11.2791 14.75 11.6191 14.75 13.0291V14.0291C14.75 15.0691 14.75 16.7791 12 16.7791ZM10.75 12.7791C10.75 12.8591 10.75 12.9491 10.75 13.0291V14.0591C10.75 15.0891 10.75 15.2791 12 15.2791C13.25 15.2791 13.25 15.1191 13.25 14.0491V13.0291C13.25 12.9491 13.25 12.8591 13.25 12.7791C13.17 12.7791 13.08 12.7791 13 12.7791H11C10.92 12.7791 10.83 12.7791 10.75 12.7791Z"
                      fill="#FFD342"
                    ></path>
                  </svg>
                  <a href="#" class="item-cat-04">
                    کسب و کار
                  </a>
                </div>
                <div class="post-title-wrap-04">
                  <a href="#">
                    <h2 class="post-title-04">
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
                    </h2>
                  </a>
                </div>
              </div>
              <div class="post-excerpt-04">
                <p>
                  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
                  با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و
                  مجله در ستون و سطرآنچنان که...
                </p>
              </div>
            </div>
          </div>
          <div class="post-content-bottom-04">
            <a class="item-main-btn-04" href="">
              <span>مشاهده بیشتر</span>
            </a>
            <a href="#" class="item-sec-btn-04">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="25"
                viewBox="0 0 24 25"
                fill="none"
              >
                <path
                  d="M8 2.02905V5.02905"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M16 2.02905V5.02905"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  opacity="0.4"
                  d="M7 13.0291H15"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  opacity="0.4"
                  d="M7 17.0291H12"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M16 3.52905C19.33 3.70905 21 4.97905 21 9.67905V15.8591C21 19.9791 20 22.0391 15 22.0391H9C4 22.0391 3 19.9791 3 15.8591V9.67905C3 4.97905 4.67 3.71905 8 3.52905H16Z"
                  stroke="#303030"
                  stroke-width="1.5"
                  stroke-miterlimit="10"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <span>شرکت در رویداد</span>
            </a>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Card04;
